let days = [["","","","",""],
    ["","","","",""],
    ["","","","",""],
    ["","","","",""],
    ["","","","",""],
    ["","","","",""],
    ["","","","",""],
    ["","","","",""],
    ["","","","",""],
    ["","","","",""],
    ["","","","",""],
    ["","","","",""],
    ["","","","",""],
    ["","","","",""],
    ["","","","",""],
    ["","","","",""],
    ["","","","",""],
    ["","","","",""],
    ["","","","",""],
    ["","","","",""],
    ["","","","",""],
    ["","","","",""],
    ["","","","",""],
    ["5:54","13:30","16:51","19:33","20:44"],
    ["5:55","13:29","16:51","19:31","20:42"],
    ["5:56","13:29","16:50","19:30","20:41"],
    ["5:56","13:29","16:49","19:30","20:40"],
    ["5:57","13:28","16:48","19:28","20:38"],
    ["5:58","13:28","16:47","19:26","20:47"],
    ["5:58","13:28","16:46","19:25","20:36"],
    ["5:59","13:29","16:50","19:25","20:36"]
];

let week =["الاثنين","الثلاثاء","الاربعاء","الخميس","الجمعة","السبت","الاحد"];
let M=["يناير","فبراير","مارس","ابريل","ماي","يونيو","يليوز","غشت","شتنبر","نونبر","دجنبر",""]
let keyD =new Date().getDate();
let keyW =new Date().getDay();
let month = new Date().getMonth();


for(let i=0;i<5;i++){
    if(i===0) document.querySelector(".f").innerHTML = days[keyD-1][i];
    if(i===1) document.querySelector(".d").innerHTML = days[keyD-1][i];
    if(i===2) document.querySelector(".a").innerHTML = days[keyD-1][i];
    if(i===3) document.querySelector(".m").innerHTML = days[keyD-1][i];
    if(i===4) document.querySelector(".i").innerHTML = days[keyD-1][i];
}

let text = `2003- ${week[keyW]} - ${keyD} - ${M[month]}`
document.querySelector(".date").innerHTML = text;

